# ClosestPointsPairBetweenTwoCurves Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ClosestPointsPairBetweenTwoCurves Members
ClosestPointsPairBetweenTwoCurves Class Constructors Methods Properties See Also
---
The ClosestPointsPairBetweenTwoCurves type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ClosestPointsPairBetweenTwoCurves()()()() | Obtain a new instance of ClosestPointsPairBetweenTwoCurves class. |
| ClosestPointsPairBetweenTwoCurves(ClosestPointsPairBetweenTwoCurves) | Creates a copy of the ClosestPointsPairBetweenTwoCurves. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ClosestPointsPairBetweenTwoCurves |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Distance | Distance from point on first curve to the point on second curve. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| ParameterOnFirstCurve | 1d raw (not normalized) parameter of the point on the first curve. |
| ParameterOnSecondCurve | 1d raw (not normalized) parameter of the point on the second curve. |
| XYZPointOnFirstCurve | Point on the first curve in 3d coordinates. |
| XYZPointOnSecondCurve | Point on the second curve in 3d coordinates. |

# See Also
ClosestPointsPairBetweenTwoCurves Class
Autodesk.Revit.DB Namespace